//--------------------------------------------------------------------------------------------------

const File = require('./file');

/*--------------------------------------------------------------------------------------------------
|
| -> Вернуть результат
|
|-------------------------------------------------------------------------------------------------*/

const result = (res, resolve, callback) => {
// Возвращаем результат через пользовательский callback
    if (typeof callback == 'function') {
        callback.call(res, res);
    }
    
// Возвращаем результат через промис
    resolve(res);
};

/*--------------------------------------------------------------------------------------------------
|
| -> Сохранить данные в файл
|
|-------------------------------------------------------------------------------------------------*/

module.exports = (fileName, content, callback) => {
// Путь к хранилищу это текущий каталог
    const Storage = new File('./');
    
// Возвращаем результат через промис
    return new Promise((resolve) => {
    // Записываем данные
        Storage.set(fileName, content, (res) => {
        // Файл уже создан
            if (res.error_code != 102) {
            // Возвращаем результат
                result(res, resolve, callback);
            }
            
        // Файл еще не создан
            if (res.error_code == 102) {
            // Создаем файл
                Storage.add(fileName, content, (res) => {
                // Возвращаем результат
                    result(res, resolve, callback);
                });
            }
        });
    });
};

//--------------------------------------------------------------------------------------------------